hardcoreerik/OrcSDR/apps/orcsdr-tab5/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FREERTOS_HZ=1000
# M5GFX map/dashboard transitions run on app_main; 8 KiB overflowed while
# returning from ADS-B and opening the LoRa map during the serial soak.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_ESP_HOSTED_HOST_SDIO_TX_Q_SIZE=4
CONFIG_ESP_HOSTED_HOST_SDIO_RX_Q_SIZE=2
# Espressif requires proving the P4<->C6 transport at a conservative clock
# before raising it for throughput. Sustained HTTPS receive is not stable at
# 20 MHz on this P4/C6 pair, so qualify 10 MHz first.
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=10000
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
# Use ESP-Hosted 3.x's Tab5 board profile: it locks Slot 1 to the on-board C6.
CONFIG_ESP32P4_TAB5_C6_BOARD=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=8
# The Tab5 C6 image is brought up by probing first, with a reset fallback if
# SDIO enumeration fails. This is the mode verified with the installed C6.
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ONLY_IF_NECESSARY=y
CONFIG_ESP_HOSTED_HOST_CP_RESET_SETTLE_MS=1500
# A runtime SDIO timeout must leave Wi-Fi unavailable, not restart the P4
# forever. ESP_HOSTED_EVENT_TRANSPORT_FAILURE remains available for recovery.
CONFIG_ESP_HOSTED_HOST_TRANSPORT_RESTART_ON_FAILURE=n
# Tab5 powers the C6 through M5.begin(); initialize Hosted explicitly after
# that board setup instead of starting background SDIO retries before app_main.
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=y
# Network Split is a separate, paired P4/C6 feature.  OrcSDR uses the normal
# station APIs and the installed C6 advertises WLAN only, so leave it disabled.
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
# Packet Mode is paired with the installed C6 packet image. It trades peak
# throughput for bounded host buffers during station join and HTTPS downloads.
CONFIG_ESP_HOSTED_HOST_SDIO_RX_STREAMING_MODE=y
# Packet buffers are still substantial; preserve internal DMA for SDIO/I2S.
CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM=y
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
# Keep incidental mallocs out of on-chip RAM. DMA-capable internal
# memory is reserved for Hosted SDIO + I2S only; RTL URBs stay in PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=40960
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Catalog HTTPS needs TLS buffers larger than the remaining internal DMA headroom.
# Keep Hosted/I2S DMA internal; place ordinary mbedTLS allocations in PSRAM.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# mDNS after STA-up was allocating its task from internal RAM and the
# following Hosted SDIO TX/RX alloc asserted (sendbuf / pkt_rxbuff).
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
# PC USB-JTAG VBUS sag trips the P4 BOD at the default 2.6V. Detector
# reset is off on purpose; the radio keeps running through the sag.
CONFIG_ESP_BROWNOUT_DET=n
# Preserve unattended soak failures across reboot for idf.py coredump-info.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA256=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=32
CONFIG_ESP_COREDUMP_STACK_SIZE=4096
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_DSP_MAX_FFT_SIZE_8192=y
